Revit 2027 API
BuiltInFailures.DPartFailures.RemovingUndividedDPartParents Property
 These parts are not intersected by any dividing references. They will be removed from the division.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RemovingUndividedDPartParents { get; }
Public Shared ReadOnly Property RemovingUndividedDPartParents As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RemovingUndividedDPartParents {
	FailureDefinitionId^ get ();
}
static member RemovingUndividedDPartParents : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace